{
  "BannerSection": {
    "title1": "Adapting and evolving responsive developer",
    "title2": "Jaekyeong Yuk"
  },
  "OutcomeSection": {
    "header1": "Striving to create services that will be remembered by people for a long time",
    "header2": "So I've been consistently working hard until now",
    "title1": "Accumulated Work Days",
    "value1": "{days}",
    "value1Unit": "+",
    "title2": "Accumulated Course Attendees",
    "value2": "{attends}",
    "value2Unit": "+",
    "title3": "Projects Worked On <span>Web / Engineering / Design</span>",
    "value3": "{services}",
    "value3Unit": "+",
    "title4": "Awards Won <span>Coding Competition Winner</span>",
    "value4": "{awards}",
    "value4Unit": ""
  },
  "ObjectiveSection": {
    "title": "Goals as a Developer",
    "description1": "I started developing because I wanted to solve the discomfort I felt in school on my own.",
    "description2": "I want to create services that are easy for everyone to use and make life more convenient.",
    "sliderTitle": "Representative Projects"
  },
  "HistorySection": {
    "sectionTitle1": "I am still",
    "sectionTitle2": "growing rapidly today",
    "contentsCount": "12",
    "contents": [
      {
        "year": "2023",
        "month": "September 2023",
        "content": "PCCP JavaScript Coding Proficiency Certification, GREB Co., Ltd."
      },
      {
        "year": "",
        "month": "August 2023",
        "content": "Personal Branding, <span>Nebaram Website</span> Deployment"
      },
      {
        "year": "",
        "month": "June 2023",
        "content": "ICT Innovation Square Coding Competition <span>Grand Prize</span> (Jeonju)"
      },
      {
        "year": "",
        "month": "May 2023",
        "content": "Real-time Chatroom Service, <span>BlooWays</span> Deployment"
      },
      {
        "year": "",
        "month": "February 2023",
        "content": "Web Service Professional Community, <span>BlooBolt</span> Deployment"
      },
      {
        "year": "2022",
        "month": "October 2022",
        "content": "Web Exhibition Object Information Design, <span>Museum Union Gallery</span> Deployment"
      },
      {
        "year": "",
        "month": "September 2022",
        "content": "Information Processing Engineer Certification (Korea Industrial Human Resources Development Corporation)"
      },
      {
        "year": "2021",
        "month": "November 2021",
        "content": "Tiramisu Cake Online Store, <span>TIRA</span> Deployment"
      },
      {
        "year": "",
        "month": "August 2021",
        "content": "Dessert Brand, THERA Rebranding"
      },
      {
        "year": "",
        "month": "July 2021",
        "content": "Python Linear Algebra Module Learning Course Production <span>Over 3,200 students, Rating 4.9/5.0</span><div>*Invited as an instructor by major online learning platforms (Inflearn / Programmers)</div>"
      },
      {
        "year": "2020",
        "month": "July 2020",
        "content": "Personal Tech Blog Operation <span>Daily Average Visits: 700, Biweekly Post Uploads</span>"
      },
      {
        "year": "",
        "month": "May 2020",
        "content": "Design Project Production Activities: Typographic, Editorial / Interior Design, 3D Graphic, Branding"
      }
    ]
  },

  "SkillSection": {
    "sectionTitle1": "Introducing My Strengths",
    "sectionTitle2": "and Technical Competencies",
    "description1": "I can handle development, design, publishing, and deployment on my own.",
    "description2": "This enables me to communicate effectively with professionals from different roles.",

    "skill1": "Front-End",
    "skill1Title1": "Creating Smooth",
    "skill1Title2": "and Unique UI",
    "skill1Description1": "I can request and fetch data at the appropriate times, applying various animation effects for presentation. I can efficiently develop using libraries, but I'm also capable of implementing everything with pure JavaScript. After implementation, I continuously check that the features work as intended from the user's perspective.",
    "skill1Description2": "<span>Skills</span>TypeScript, React.js, Next.js, Redux Toolkit & Saga, React-Query, SWR",

    "skill2": "Back-End",
    "skill2Title1": "Creating secure",
    "skill2Title2": "Web Server & DB",
    "skill2Description1": "I can build API servers for data requests and set up databases, and I can create real-time data transmission functionality using sockets. I'm experienced in deploying stable websites using AWS and proxy web servers like Nginx.",
    "skill2Description2": "<span>Skills</span>Node.js, Nest.js, Express.js, Prisma, Sequelize, Socket.io, Puppeteer, AWS EC2+S3+Lambda, MySQL, PostgreSQL, MongoDB, Python",

    "skill3": "Design / Publishing",
    "skill3Title1": "Pursuing consistent",
    "skill3Title2": "User-centered interfaces",
    "skill3Description1": "Before development, I use design tools to sketch out screens and then proceed with publishing work. I'm adept at creating perfectly responsive publishing, starting from large screens or small screens. Currently, I'm reading the Apple Human Interface Guidelines (HIG) and plan to implement it in future projects. This site you're viewing right now is my first project adhering to the HIG.",
    "skill3Description2": "<span>Skills</span>TailwindCSS, Emotion, Framer-motion, Styled-Components, SCSS, Illustrator, PhotoShop, InDesign",

    "skill4": "Skill Communication",
    "skill4Title1": "Collaborating effectively",
    "skill4Title2": "With Designers",
    "skill4Description1": "I also have a background in visual design, having dual majored in it. This experience allows me to understand the roles of different position holders in projects. Whether it's front-end work or publishing work, I can tailor my communication to match your needs. Moreover, I am confident that the features and screen publishing I handle will be error-free from a user perspective.",
    "skill4Description2": "<span>Skills</span>Figma",

    "projectsLinkLabel": "Explore My Projects",
    "projectsLink": "Projects Page"
  },

  "QuestionSection": {
    "sectionTitle": "Curious about me",
    "questions": [
      {
        "title": "What are the advantages of working together?",
        "description": "I have experienced various roles, so I have a good understanding of the roles of different position holders. If you require front-end work, I can act as a front-end developer, and for publishing work, I can switch to a publisher. Furthermore, when it comes to feature development and screen publishing, I ensure there are no issues from the user's perspective."
      },
      {
        "title": "What are the disadvantages of working together?",
        "description": "During work, there may be occasions where we have to prioritize very fine details or minor errors, causing the priorities of the tasks to change. In situations where significant tasks need to be completed, small errors in functional or design aspects of smaller tasks might lead to changes. I'm a perfectionist who believes that even in situations requiring major task completion, addressing minor errors is crucial. Depending on your partner's preferences, this trait can be an advantage or a disadvantage."
      },
      {
        "title": "Do you do design work yourself? What tools do you use for collaboration with designers?",
        "description": "Certainly. However, due to limited time and the need to invest more time in the development phase, I have developed and utilize our own design and publishing UI systems. While I prefer using Figma for collaboration, I'm open to using any tools that designers prefer."
      },
      {
        "title": "Are you currently conducting or planning any courses?",
        "description": "I haven't attempted it recently due to my busy workload. However, in about a year, when I have a bit more free time, I plan to return with an impressive clone project development course!"
      }
    ]
  }
}
